# Intermediate Pandas

***SESSION 1: Handling Missing Values (Pandas)***

*What Are Missing Values?*

*A missing value means data is not available for a row-column cell.*

Example:

| Name  | Age | Salary |
| ----- | --- | ------ |
| Rahul | 25  | 50000  |
| Anita | NaN | 60000  |
| John  | 30  | NaN    |

*How Pandas Detects Missing Values*

In [1]:
import pandas as pd

In [2]:

data = {
    'Name': ['Rahul', 'Anita', 'John', 'Meena'],
    'Age': [25, None, 30, None],
    'Salary': [50000, 60000, None, 55000],
    'City': ['Delhi', 'Mumbai', None, 'Delhi']
}

df = pd.DataFrame(data)

In [3]:
# Check Missing Values (Row by Row)

df.isnull()

    Name    Age  Salary   City
0  False  False   False  False
1  False   True   False  False
2  False  False    True   True
3  False   True   False  False

In [4]:
# Count Missing Values

df.isnull().sum()

Name      0
Age       2
Salary    1
City      1
dtype: int64

*Practice 1*

In [5]:
# Load any dataset

In [6]:
# Count missing values per column

In [7]:
# Identify column with highest missing data

In [8]:
# Removing Missing Values

df.dropna()

    Name   Age   Salary   City
0  Rahul  25.0  50000.0  Delhi

In [9]:
# Drop Columns with Missing Values

df.dropna(axis=1)

    Name
0  Rahul
1  Anita
2   John
3  Meena

In [10]:
# Drop Rows Only If ALL Values Missing

df.dropna(how='all')

    Name   Age   Salary    City
0  Rahul  25.0  50000.0   Delhi
1  Anita   NaN  60000.0  Mumbai
2   John  30.0      NaN    None
3  Meena   NaN  55000.0   Delhi

In [11]:
# Drop Based on Specific Column

df.dropna(subset=['Salary'])

    Name   Age   Salary    City
0  Rahul  25.0  50000.0   Delhi
1  Anita   NaN  60000.0  Mumbai
3  Meena   NaN  55000.0   Delhi

*Practice 2*

In [12]:
#Load any dataset

In [13]:
# Count missing values per column

In [14]:
# Identify column with highest missing data

*Filling Missing Values (fillna)*

In [15]:
# Fill Numeric Columns (Mean / Median)

df['Age'].fillna(df['Age'].mean(), inplace=True)
df['Salary'].fillna(df['Salary'].median(), inplace=True)

C:\Users\saraf\AppData\Local\Temp\ipykernel_14284\1875863187.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(df['Age'].mean(), inplace=True)
C:\Users\saraf\AppData\Local\Temp\ipykernel_14284\1875863187.py:4: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Salary'].fillna(df['Salary'].median(), inplace=True)

In [16]:
# Fill Categorical Columns

df['City'].fillna('Unknown', inplace=True)

C:\Users\saraf\AppData\Local\Temp\ipykernel_14284\373712701.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['City'].fillna('Unknown', inplace=True)

In [17]:
# Fill All Missing Values at Once

df.fillna(0)

    Name   Age   Salary     City
0  Rahul  25.0  50000.0    Delhi
1  Anita  27.5  60000.0   Mumbai
2   John  30.0  55000.0  Unknown
3  Meena  27.5  55000.0    Delhi

In [18]:
# Forward Fill / Backward Fill

df.fillna(method='ffill')
df.fillna(method='bfill')

C:\Users\saraf\AppData\Local\Temp\ipykernel_14284\256482124.py:3: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill')
C:\Users\saraf\AppData\Local\Temp\ipykernel_14284\256482124.py:4: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='bfill')

    Name   Age   Salary     City
0  Rahul  25.0  50000.0    Delhi
1  Anita  27.5  60000.0   Mumbai
2   John  30.0  55000.0  Unknown
3  Meena  27.5  55000.0    Delhi

*Practice  3*

In [19]:
#Fill Age with mean

In [20]:
# Fill Salary with median

In [21]:
# Fill City with "Unknown"

In [22]:
# Verify no missing values remain

*Real-World Scenario Thinking*

**INTERVIEW QUESTIONS**

Why is data missing? 
- Due to errors, non-response, system issues, or data not being recorded.

Is missing value random?
- It may be random (MCAR/MAR) or systematic (NMAR).

Should missing value be treated as a category? 
- Yes, when “missing” itself carries meaningful information.

What are missing values in Pandas?
- They are absent or undefined data points in a DataFrame or Series.

How does Pandas represent missing data?
- Using NaN, None, or NaT (for datetime).

Why is handling missing values important?
- To avoid errors and ensure accurate analysis and modeling.

Difference between dropna() and fillna()?
- dropna() removes rows/columns with missing values, while fillna() replaces them with a specified value.

When would you use mean vs median?
- Use mean for symmetric data without outliers, median for skewed data or with outliers.

How do you fill missing categorical values?
- Replace with mode, a constant (e.g., "Unknown"), or create a separate "Missing" category.

**Coding**

In [23]:
# Count missing values per column

df.isna().sum()

Name      0
Age       0
Salary    0
City      0
dtype: int64

In [24]:
# Fill missing Salary with median

df['Salary'] = df['Salary'].fillna(df['Salary'].median())

In [25]:
# Drop rows where Age is missing

df = df.dropna(subset=['Age'])

**SESSION 2: GroupBy**

*What is GroupBy?*

- *GroupBy = split → apply → combine*

*Excel Analogy :*

*If you know Excel :*

- GroupBy = Pivot Table

- SQL users: GROUP BY

In [26]:

data = {
    'Employee': ['A', 'B', 'C', 'D', 'E', 'F'],
    'Department': ['HR', 'IT', 'IT', 'HR', 'Finance', 'IT'],
    'City': ['Delhi', 'Delhi', 'Mumbai', 'Mumbai', 'Delhi', 'Delhi'],
    'Salary': [40000, 60000, 55000, 45000, 70000, 65000]
}

df = pd.DataFrame(data)

*Basic GroupBy Syntax*

In [29]:
# General Structure

df.groupby('column')['target_column'].aggregation()

KeyError: 'column'

In [30]:
# Example 1: Average Salary per Department

df.groupby('Department')['Salary'].mean()

Department
Finance    70000.0
HR         42500.0
IT         60000.0
Name: Salary, dtype: float64

*Practice 1*

In [ ]:
# Find average salary per city

df.groupby('City')['Salary'].mean()

In [ ]:
# Find total salary per department

df.groupby('Department')['Salary'].sum()

*Multiple Aggregations*

In [ ]:
 
df.groupby('Department')['Salary'].agg(['mean', 'max', 'min', 'count'])

# This gives:

# Mean salary
# Highest salary
# Lowest salary
# Number of employees

*Rename Aggregated Columns*

In [ ]:
df.groupby('Department')['Salary'].agg(
    Avg_Salary='mean',
    Max_Salary='max',
    Employees='count'
)

*Practice 2*

In [ ]:
# Average and maximum salary per city

result = (
    df.groupby('City')['Salary']
      .agg(Average_Salary='mean', Maximum_Salary='max')
)

result

*GroupBy on Multiple Columns*

In [ ]:
# Salary by City & Department

df.groupby(['City','Department']) ['Salary'].mean()

In [ ]:
# Reset Index

result = df.groupby(['City', 'Department'])['Salary'].mean().reset_index()

*Practice 3*

In [ ]:
# Total salary by City & Department
df.groupby(['City','Department' ])['Salary'].sum()

In [ ]:
# Reset index and store result in a DataFrame

df.groupby(['City','Department' ])['Salary'].sum().reset_index()

*GroupBy with Count*

In [ ]:
# Count Employees per Department

df.groupby('Department')['Employee'].count()

 # or
 
df.groupby('Department').size()

*Practice 4*

In [ ]:
# Number of employees per city

df.groupby('City')['Employee'].count()

# or

df.groupby('City').size()

In [ ]:
# Number of employees per department

df.groupby('Department') ['Employee'].count

# or

df.groupby('Department').size()

*GroupBy + Filtering*

In [ ]:
# Departments with Avg Salary > 50,000

avg_salary = df.groupby('Department')['Salary'].mean()
avg_salary[avg_salary > 50000]

*Practice 5*

In [ ]:
# Cities with avg salary > 55,000

avg_salary =df.groupby('City')['Salary'].mean()
avg_salary[avg_salary>55000]

In [ ]:
# Departments with more than 2 employees

dept_count = df.groupby('Department').size()
dept_count[dept_count > 2]

**Coding**

In [ ]:
# Avg salary per department

df.groupby('Department')['Salary'].mean()

In [ ]:
# Total salary per city
df.groupby('City')['Salary'].sum()

In [ ]:
# Count employees per department and city

df.groupby(['Department', 'City']).size()

**INTERVIEW QUESTIONS**

What is GroupBy in Pandas? 
- It groups data based on one or more columns to perform aggregate operations.

How is GroupBy similar to SQL? 
- It works like SQL GROUP BY for aggregations such as SUM, AVG, COUNT.

What does split–apply–combine mean? 
- Split data into groups, apply a function, then combine the results.

Difference between .count() and .size()? 
- .count() counts non-null values, while .size() counts total rows including nulls.

Why do we use .reset_index() after GroupBy? 
- To convert grouped index levels back into regular columns.

Can GroupBy work on multiple columns? 
- Yes, by passing a list of column names to groupby().

***SESSION 3: Merge, Join & Concat***

*Understand Tables First*

In [ ]:
# Table 1: Employees

employees = pd.DataFrame({
    'emp_id': [1, 2, 3, 4],
    'name': ['Amit', 'Sara', 'John', 'Meena'],
    'dept_id': [101, 102, 101, 103]
})

In [ ]:
# Table 2: Departments

departments = pd.DataFrame({
    'dept_id': [101, 102, 104],
    'dept_name': ['HR', 'IT', 'Finance']
})

**MERGE**

*What is merge?*

- Combine tables based on a common column

In [ ]:
# Basic Syntax

pd.merge(left_df, right_df, on='column', how='type')

**INNER JOIN**

Meaning:

- Keeps only matching records

- Non-matching rows are removed

In [ ]:
# Code

pd.merge(employees, departments, on='dept_id', how='inner')

*Practice 1*

In [ ]:
# Identify which rows were removed

**LEFT JOIN**

Meaning:

- Keep ALL rows from left table

- Fill missing values with NaN

In [ ]:
# code

pd.merge(employees, departments, on='dept_id', how='left')

**RIGHT JOIN**

Meaning:

- Keep ALL rows from right table

In [ ]:
# code

pd.merge(employees, departments, on='dept_id', how='right')

**OUTER JOIN**

Meaning:

- Keep ALL rows from both tables

- Fill unmatched with NaN

In [ ]:
# code

pd.merge(employees, departments, on='dept_id', how='outer')

**Join vs Merge**

In [ ]:
# JOIN (Index-based)

employees.set_index('dept_id').join(
    departments.set_index('dept_id')
)

**CONCAT**

When to Use Concat:

- Monthly sales data
- Year-wise files
- Same structure tables

In [ ]:
jan = pd.DataFrame({'Sales january': [100, 200]})
feb = pd.DataFrame({'Sales febuary': [150, 250]})

pd.concat([jan, feb])

In [ ]:
# Concat Columns Side-by-Side

pd.concat([jan, feb] , axis = 1)

In [ ]:
# Combine 3 months sales data

mar = pd.DataFrame({'Sales march': [200, 450]})
pd.concat([jan,feb,mar], axis = 1)

In [ ]:
df.info()

In [ ]:
df.isnull().sum()

In [ ]:
# Merge employee & department table


pd.merge(employees, departments, on='dept_id', how='outer')

In [ ]:
# Left join customers & orders

In [ ]:
# Concatenate yearly sales data

**Interview Question**

*Difference between merge() and join()?*

merge() 
- Combines DataFrames using common columns or keys (similar to SQL joins, very flexible).

join() 
- Combines DataFrames mainly using the index (simpler, less flexible).

What is merge in Pandas?
- merge() combines DataFrames based on common columns or keys, similar to SQL joins.

Difference between merge and concat?
- merge() joins data horizontally using keys, while concat() stacks DataFrames vertically or horizontally without matching keys.

Explain different join types:

- Inner join → Only matching records from both tables
- Left join → All records from left table + matching from right
- Right join → All records from right table + matching from left
- Outer join → All records from both tables, with NaN where no match exists

Customers table (1M) + Orders table (500k): which join?
- Use Left Join to keep all customers and attach orders where available.

Monthly files need to be combined – merge or concat?
- Use concat() because files have the same structure and need row-wise stacking.

Missing values after merge – what will you do?
- Analyze why they occurred, then fill, flag, or drop based on business meaning.

 ***SESSION 4: Mini Project – Real-World Sales Analysis***

*Business Scenario*

you are a Data Analyst at an e-commerce company.

Management wants to know:

- Total revenue
- Revenue by city
- Average order value
- Top customers
- Clean dataset for reporting

In [2]:
import pandas as pd

*Datasets Provided*

In [3]:
# Orders Table

orders = pd.DataFrame({
    'order_id': [101, 102, 103, 104, 105, 106],
    'customer_id': [1, 2, 3, 2, 4, None],
    'amount': [2500, 3000, None, 1500, 4000, 2000],
    'city': ['Delhi', 'Mumbai', 'Delhi', None, 'Mumbai', 'Delhi'],
    'order_date': ['2023-01-10', '2023-01-11', '2023-01-12',
                   '2023-01-13', '2023-01-14', '2023-01-15']
})

In [4]:
# Customers Table

customers = pd.DataFrame({
    'customer_id': [1, 2, 3, 4],
    'name': ['Amit', 'Sara', 'John', 'Meena'],
    'gender': ['M', 'F', 'M', 'F']
})

**Step 1 – Inspect the Data (ALWAYS FIRST)**

In [5]:
orders.info()
customers.info()

orders.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   order_id     6 non-null      int64
 1   customer_id  5 non-null      float64
 2   amount       5 non-null      float64
 3   city         5 non-null      object
 4   order_date   6 non-null      object
dtypes: float64(2), int64(1), object(2)
memory usage: 372.0+ bytes
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   customer_id  4 non-null      int64
 1   name         4 non-null      object
 2   gender       4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

order_id       0
customer_id    1
amount         1
city           1
order_date     0
dtype: int64

**Step 2 – Handle Missing Values**

In [6]:
# Fix amount
orders['amount'].fillna(orders['amount'].median(), inplace=True)

C:\Users\saraf\AppData\Local\Temp\ipykernel_3804\3393102751.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  orders['amount'].fillna(orders['amount'].median(), inplace=True)

In [7]:
# Fix city
orders['city'].fillna('Lucknow', inplace=True)

C:\Users\saraf\AppData\Local\Temp\ipykernel_3804\3821531046.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  orders['city'].fillna('Lucknow', inplace=True)

In [8]:
orders

   order_id  customer_id  amount     city  order_date
0       101          1.0  2500.0    Delhi  2023-01-10
1       102          2.0  3000.0   Mumbai  2023-01-11
2       103          3.0  2500.0    Delhi  2023-01-12
3       104          2.0  1500.0  Lucknow  2023-01-13
4       105          4.0  4000.0   Mumbai  2023-01-14
5       106          NaN  2000.0    Delhi  2023-01-15

In [9]:
# Drop missing customer_id
orders.dropna(subset=['customer_id'], inplace=True)

In [10]:
orders

   order_id  customer_id  amount     city  order_date
0       101          1.0  2500.0    Delhi  2023-01-10
1       102          2.0  3000.0   Mumbai  2023-01-11
2       103          3.0  2500.0    Delhi  2023-01-12
3       104          2.0  1500.0  Lucknow  2023-01-13
4       105          4.0  4000.0   Mumbai  2023-01-14

**Step 3 – Convert Date Column**

In [27]:
orders['order_date'] = pd.to_datetime(orders['order_date'])

In [14]:
orders

   order_id  customer_id  amount     city order_date
0       101          1.0  2500.0    Delhi 2023-01-10
1       102          2.0  3000.0   Mumbai 2023-01-11
2       103          3.0  2500.0    Delhi 2023-01-12
3       104          2.0  1500.0  Lucknow 2023-01-13
4       105          4.0  4000.0   Mumbai 2023-01-14

In [28]:
customers

   customer_id   name gender
0            1   Amit      M
1            2   Sara      F
2            3   John      M
3            4  Meena      F

**Step 4 – Merge Datasets**

In [16]:
sales = pd.merge(orders, customers, on='customer_id', how='left')

In [29]:
sales

   order_id  customer_id  amount     city order_date   name gender
0       101          1.0  2500.0    Delhi 2023-01-10   Amit      M
1       102          2.0  3000.0   Mumbai 2023-01-11   Sara      F
2       103          3.0  2500.0    Delhi 2023-01-12   John      M
3       104          2.0  1500.0  Lucknow 2023-01-13   Sara      F
4       105          4.0  4000.0   Mumbai 2023-01-14  Meena      F

**Step 5 – Business Analysis**

In [17]:
# Total Revenue 
sales['amount'].sum()

np.float64(13500.0)

In [20]:
# Revenue by City
sales.groupby('city')['amount'].sum().reset_index()

      city  amount
0    Delhi  5000.0
1  Lucknow  1500.0
2   Mumbai  7000.0

In [21]:
# Average Order Value
sales['amount'].mean()

np.float64(2700.0)

In [37]:
# Top 3 Customers
sales.groupby('name')['amount'].sum() \
     .sort_values(ascending=False) \
     .head(3)

name
Sara     4500.0
Meena    4000.0
John     2500.0
Name: amount, dtype: float64

**Step 6 – Final Clean Dataset**

In [25]:
final_df = sales[['order_id', 'order_date', 'name', 'gender', 'city', 'amount']]

**Step 7 – Save Output**

In [35]:
final_df.to_csv('cleaned_sales_data.csv', index=False)